{
  "navigation": {
    "home": "Accueil",
    "about": "À propos",
    "projects": "Projets",
    "skills": "Compétences",
    "experience": "Expérience",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Bonjour, je suis Yassine.",
    "role": "Je suis",
    "title": "Développeur Laravel Senior",
    "experience": "5+ ans",
    "description": "d'expérience. Je me spécialise dans la création",
    "focus": "d'applications web d'entreprise",
    "with": "avec",
    "tech": "Laravel, Multi-Tenancy, Filament, Livewire et PHP moderne",
    "contactButton": "Contactez-moi ici",
    "downloadCV": "Télécharger CV"
  },
  "about": {
    "title": "À Propos de Moi",
    "description": "Je suis un développeur Laravel senior spécialisé dans la création d'applications web évolutives de niveau entreprise. Avec plus de 5 ans d'expérience, j'ai conçu et développé des systèmes complexes incluant des plateformes SaaS multi-locataires, des solutions e-commerce et des panneaux d'administration complets servant des milliers d'utilisateurs.",
    "background": "Mon expertise couvre l'ensemble de l'écosystème Laravel, des implémentations avancées de multi-tenancy aux fonctionnalités temps réel avec WebSockets. J'excelle dans la création d'APIs robustes, l'implémentation de logique métier complexe et l'optimisation des performances d'applications. Ma stack technique inclut Laravel Filament pour les interfaces d'administration, Livewire pour les frontends dynamiques, et des pratiques de déploiement modernes avec Docker et les plateformes cloud.",
    "approach": "J'aborde chaque projet avec un engagement envers le code propre, l'optimisation des performances et la conception réfléchie de l'expérience utilisateur. Je crois en la construction d'applications qui non seulement répondent aux exigences techniques, mais qui apportent également une réelle valeur aux utilisateurs. La stack TALL (Tailwind CSS, Alpine.js, Laravel, Livewire) est devenue ma pile technologique préférée pour offrir des expériences web exceptionnelles."
  },
  "projects": {
    "title": "Ce Que Je Construis"
  },
  "projectCapabilities": {
    "ecommerce": {
      "title": "Plateformes E-commerce",
      "description": "Boutiques en ligne sur mesure avec des fonctionnalités telles que catalogues de produits, paniers d'achats, intégration sécurisée de passerelles de paiement (Stripe, PayPal), gestion des commandes et comptes utilisateurs."
    },
    "adminPanels": {
      "title": "Panneaux d'Administration & Tableaux de Bord",
      "description": "Interfaces d'administration puissantes et intuitives pour gérer les données d'application, les utilisateurs et les paramètres. Inclut des fonctionnalités telles que le contrôle d'accès basé sur les rôles, la visualisation des données et la journalisation des activités."
    },
    "saas": {
      "title": "Applications SaaS",
      "description": "Produits Software-as-a-Service évolutifs et sécurisés avec des fonctionnalités telles que la gestion des abonnements, la multi-location (multi-tenancy), l'intégration des utilisateurs (onboarding) et une infrastructure back-end robuste."
    }
  },
  "skills": {
    "title": "Mes Compétences"
  },
  "experience": {
    "title": "Mon Expérience"
  },
  "contact": {
    "title": "Contactez-Moi",
    "nameLabel": "Votre nom",
    "emailLabel": "Votre email",
    "messageLabel": "Votre message",
    "submitButton": "Envoyer",
    "successMessage": "Merci pour votre message! Je vous répondrai bientôt.",
    "errorMessage": "Une erreur s'est produite. Veuillez réessayer."
  },
  "footer": {
    "copyright": " 2024 Yassine. Tous droits réservés.",
    "builtWith": "Construit avec Next.js et Tailwind CSS"
  },
  "theme": {
    "light": "Mode clair",
    "dark": "Mode sombre"
  }
}