{
  "navigation": {
    "home": "Accueil",
    "about": "À propos",
    "projects": "Projets",
    "skills": "Compétences",
    "experience": "Expérience",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Bonjour, je suis Yassine.",
    "role": "Je suis",
    "title": "Développeur Laravel Junior",
    "experience": "2+ ans",
    "description": "d'expérience. Je me spécialise dans la création",
    "focus": "d'applications web évolutives",
    "with": "avec",
    "tech": "Laravel, Filament, Livewire et PHP moderne",
    "contactButton": "Contactez-moi ici",
    "downloadCV": "Télécharger CV"
  },
  "about": {
    "title": "À Propos de Moi",
    "description": "Je suis un développeur Laravel junior avec 2+ ans d'expérience dans la création d'applications web évolutives. J'ai travaillé sur divers projets incluant des panneaux d'administration, des systèmes d'inventaire et des outils de réservation, acquérant une expérience pratique avec Laravel, Filament et Livewire tout en livrant des solutions pour des clients d'entreprise et des entreprises locales.",
    "background": "Mon expertise technique inclut les outils de l'écosystème Laravel comme Filament pour les interfaces d'administration, Livewire pour les frontends dynamiques, et des pratiques de développement modernes avec Git et les méthodologies Agile. Je maîtrise la création d'APIs REST, le travail avec les bases de données MySQL, et la création d'interfaces responsives avec Tailwind CSS et Alpine.js.",
    "approach": "Je me concentre sur l'écriture de code propre et maintenable en suivant les meilleures pratiques du développement web. Qu'il s'agisse de créer des tableaux de bord d'administration, d'implémenter la logique métier ou d'optimiser les performances d'applications, je m'engage à livrer des solutions de qualité. Je suis passionné par l'apprentissage continu et je reste à jour avec les dernières fonctionnalités Laravel et les tendances de développement."
  },
  "projects": {
    "title": "Projets en Vedette",
    "description": "Explorez un portfolio d'applications Laravel que j'ai construites, incluant des panneaux d'administration, des systèmes d'inventaire et des outils de réservation. Chaque projet démontre les meilleures pratiques Laravel, du code propre et des techniques de développement modernes.",
    "viewGithub": "Voir sur GitHub",
    "viewDemo": "Démo en Direct"
  },
  "projectCapabilities": {
    "ecommerce": {
      "title": "Plateformes E-commerce",
      "description": "Boutiques en ligne sur mesure avec des fonctionnalités telles que catalogues de produits, paniers d'achats, intégration sécurisée de passerelles de paiement (Stripe, PayPal), gestion des commandes et comptes utilisateurs."
    },
    "adminPanels": {
      "title": "Panneaux d'Administration & Tableaux de Bord",
      "description": "Interfaces d'administration puissantes et intuitives pour gérer les données d'application, les utilisateurs et les paramètres. Inclut des fonctionnalités telles que le contrôle d'accès basé sur les rôles, la visualisation des données et la journalisation des activités."
    },
    "saas": {
      "title": "Applications SaaS",
      "description": "Produits Software-as-a-Service évolutifs et sécurisés avec des fonctionnalités telles que la gestion des abonnements, la multi-location (multi-tenancy), l'intégration des utilisateurs (onboarding) et une infrastructure back-end robuste."
    }
  },
  "skills": {
    "title": "Mes Compétences"
  },
  "theme": {
    "light": "Passer en mode clair",
    "dark": "Passer en mode sombre"
  },
  "experience": {
    "title": "Mon Expérience",
    "currentJob": {
      "title": "Développeur Web",
      "location": "Satoripop, Sousse",
      "description": "Je développe et maintiens des applications web d'entreprise en utilisant Laravel, Filament, Livewire et Alpine.js, améliorant les performances et l'évolutivité. Je construis des tableaux de bord internes dans des équipes Agile, réduisant le temps de livraison des fonctionnalités de 20%. Je refactorise les bases de code héritées, améliorant la maintenabilité et la couverture de tests. Je collabore avec les designers, les chefs de projet et les clients pour livrer des fonctionnalités centrées sur l'utilisateur.",
      "date": "Août 2024 - Présent"
    },
    "internship2024": {
      "title": "Stagiaire Développeur Web",
      "location": "Satoripop, Sousse",
      "description": "J'ai construit un panneau d'administration basé sur Laravel pour un projet de fin d'études en utilisant Filament PHP, rationalisant les flux de travail backend. J'ai maîtrisé les processus de l'entreprise, livrant une application évolutive sous des délais serrés.",
      "date": "Janvier 2024 - Mai 2024"
    },
    "freelance": {
      "title": "Développeur Web Freelance",
      "location": "Ksar Hellal, Tunisie",
      "description": "J'ai développé et déployé plus de 10 applications Laravel full-stack, incluant des systèmes de réservation, des CRM et des outils d'inventaire, pour des entreprises locales. J'ai géré les cycles de vie de projets de bout en bout, de la collecte des exigences à l'assurance qualité et au support, atteignant 100% de satisfaction client. J'ai optimisé les performances en utilisant MySQL et les APIs REST.",
      "date": "2020 - 2024"
    },
    "firstIntern": {
      "title": "Stagiaire Développement Web",
      "location": "Satoripop, Sousse",
      "description": "J'ai contribué à deux projets PHP internes en utilisant Laravel et CodeIgniter, implémentant les patterns MVC et les APIs REST. J'ai rationalisé le contrôle de version avec Git, améliorant la collaboration d'équipe. J'ai amélioré l'efficacité du débogage, réduisant le temps de résolution des problèmes de 15%.",
      "date": "Été 2022"
    },
    "education": {
      "title": "Licence en Business Intelligence",
      "location": "ISG Sousse, Tunisie",
      "description": "Diplômé avec mention, me concentrant sur les solutions basées sur les données. Cours pertinents : Analyse de données, Systèmes de bases de données. J'ai développé une solide base en analyse de données, conception de systèmes et systèmes d'aide à la décision.",
      "date": "2020 - 2024"
    }
  },
  "contact": {
    "title": "Contactez-Moi",
    "description": "Veuillez me contacter directement à",
    "orForm": "ou via ce formulaire",
    "nameLabel": "Votre nom",
    "emailLabel": "Votre email",
    "messageLabel": "Votre message",
    "submitButton": "Envoyer",
    "successMessage": "Merci pour votre message! Je vous répondrai bientôt.",
    "errorMessage": "Une erreur s'est produite. Veuillez réessayer."
  },
  "footer": {
    "copyright": " 2025 Yassine. Tous droits réservés.",
    "aboutWebsite": "À propos de ce site web :",
    "builtWith": "construit avec React & Next.js, TypeScript, Tailwind CSS, three.js, Framer Motion, React Email & Resend, hébergement Vercel."
  }
}