{
  "navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Hello, I'm Yassine.",
    "role": "I'm a",
    "title": "Senior Laravel Developer",
    "experience": "5+ years",
    "description": "of experience. I specialize in building",
    "focus": "enterprise-grade web applications",
    "with": "with",
    "tech": "Laravel, Multi-Tenancy, Filament, Livewire, and modern PHP",
    "contactButton": "Contact me here",
    "downloadCV": "Download CV"
  },
  "about": {
    "title": "About Me",
    "description": "I'm a senior Laravel developer specializing in building scalable, enterprise-grade web applications. With over 5 years of experience, I've architected and developed complex systems including multi-tenant SaaS platforms, e-commerce solutions, and comprehensive admin panels that serve thousands of users.",
    "background": "My expertise spans the entire Laravel ecosystem, from advanced multi-tenancy implementations to real-time features with WebSockets. I excel at creating robust APIs, implementing complex business logic, and optimizing application performance. My technical stack includes Laravel Filament for admin interfaces, Livewire for dynamic frontends, and modern deployment practices with Docker and cloud platforms.",
    "approach": "I approach each project with enterprise-level thinking, focusing on scalable architecture, security best practices, and maintainable code. Whether it's implementing multi-tenant isolation, integrating payment gateways, or building real-time collaborative features, I deliver solutions that grow with your business needs. I'm passionate about leveraging Laravel's powerful ecosystem to create applications that are both technically excellent and user-friendly."
  },
  "projects": {
    "title": "What I Build",
    "viewGithub": "View on GitHub",
    "viewDemo": "Live Demo"
  },
  "projectCapabilities": {
    "ecommerce": {
      "title": "E-commerce Platforms",
      "description": "Custom-built online stores with features like product catalogs, shopping carts, secure payment gateway integration (Stripe, PayPal), order management, and user accounts."
    },
    "adminPanels": {
      "title": "Admin Panels & Dashboards",
      "description": "Powerful and intuitive admin interfaces for managing application data, users, and settings. Includes features like role-based access control, data visualization, and activity logging."
    },
    "saas": {
      "title": "SaaS Applications",
      "description": "Scalable and secure Software-as-a-Service products with features like subscription management, multi-tenancy, user onboarding, and robust back-end infrastructure."
    }
  },
  "skills": {
    "title": "My Skills"
  },
  "experience": {
    "title": "My Experience"
  },
  "contact": {
    "title": "Contact Me",
    "nameLabel": "Your name",
    "emailLabel": "Your email",
    "messageLabel": "Your message",
    "submitButton": "Submit",
    "successMessage": "Thank you for your message! I'll get back to you soon.",
    "errorMessage": "Something went wrong. Please try again."
  },
  "footer": {
    "copyright": " 2024 Yassine. All rights reserved.",
    "builtWith": "Built with Next.js and Tailwind CSS"
  },
  "theme": {
    "light": "Light mode",
    "dark": "Dark mode"
  }
}