{
  "navigation": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "skills": "Skills",
    "experience": "Experience",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Hello, I'm Yassine.",
    "role": "I'm a",
    "title": "Junior Laravel Developer",
    "experience": "2+ years",
    "description": "of experience. I specialize in building",
    "focus": "scalable web applications",
    "with": "with",
    "tech": "Laravel, Filament, Livewire, and modern PHP",
    "contactButton": "Contact me here",
    "downloadCV": "Download CV"
  },
  "about": {
    "title": "About Me",
    "description": "I'm a Junior Laravel developer with 2+ years of experience building scalable web applications. I've worked on various projects including admin panels, inventory systems, and booking tools, gaining hands-on experience with Laravel, Filament, and Livewire while delivering solutions for both enterprise clients and local businesses.",
    "background": "My technical expertise includes Laravel ecosystem tools like Filament for admin interfaces, Livewire for dynamic frontends, and modern development practices with Git and Agile methodologies. I'm proficient in building REST APIs, working with MySQL databases, and creating responsive interfaces with Tailwind CSS and Alpine.js.",
    "approach": "I focus on writing clean, maintainable code and following best practices in web development. Whether it's building admin dashboards, implementing business logic, or optimizing application performance, I'm committed to delivering quality solutions. I'm passionate about continuous learning and staying updated with the latest Laravel features and development trends."
  },
  "projects": {
    "title": "Featured Projects",
    "description": "Explore a portfolio of Laravel applications I've built, including admin panels, inventory systems, and booking tools. Each project demonstrates Laravel best practices, clean code, and modern development techniques.",
    "viewGithub": "View on GitHub",
    "viewDemo": "Live Demo"
  },
  "projectCapabilities": {
    "ecommerce": {
      "title": "E-commerce Platforms",
      "description": "Custom-built online stores with features like product catalogs, shopping carts, secure payment gateway integration (Stripe, PayPal), order management, and user accounts."
    },
    "adminPanels": {
      "title": "Admin Panels & Dashboards",
      "description": "Powerful and intuitive admin interfaces for managing application data, users, and settings. Includes features like role-based access control, data visualization, and activity logging."
    },
    "saas": {
      "title": "SaaS Applications",
      "description": "Scalable and secure Software-as-a-Service products with features like subscription management, multi-tenancy, user onboarding, and robust back-end infrastructure."
    }
  },
  "skills": {
    "title": "My Skills"
  },
  "theme": {
    "light": "Switch to light mode",
    "dark": "Switch to dark mode"
  },
  "experience": {
    "title": "My Experience",
    "currentJob": {
      "title": "Web Developer",
      "location": "Satoripop, Sousse",
      "description": "Develop and maintain enterprise-grade web applications using Laravel, Filament, Livewire, and Alpine.js, enhancing performance and scalability. Build internal dashboards in Agile teams, reducing feature delivery time by 20%. Refactor legacy codebases, improving maintainability and test coverage. Collaborate with designers, PMs, and clients to deliver user-focused features.",
      "date": "August 2024 - Present"
    },
    "internship2024": {
      "title": "Web Developer Intern",
      "location": "Satoripop, Sousse",
      "description": "Built a Laravel-based admin panel for a final-year project using Filament PHP, streamlining backend workflows. Mastered company processes, delivering a scalable application under tight deadlines.",
      "date": "January 2024 - May 2024"
    },
    "freelance": {
      "title": "Freelance Web Developer",
      "location": "Ksar Hellal, Tunisia",
      "description": "Developed and deployed 10+ full-stack Laravel applications, including booking systems, CRMs, and inventory tools, for local businesses. Managed end-to-end project lifecycles, from requirements gathering to QA and support, achieving 100% client satisfaction. Optimized performance using MySQL and REST APIs.",
      "date": "2020 - 2024"
    },
    "firstIntern": {
      "title": "Web Development Intern",
      "location": "Satoripop, Sousse",
      "description": "Contributed to two internal PHP projects using Laravel and CodeIgniter, implementing MVC patterns and REST APIs. Streamlined version control with Git, enhancing team collaboration. Improved debugging efficiency, reducing issue resolution time by 15%.",
      "date": "Summer 2022"
    },
    "education": {
      "title": "Bachelor's in Business Intelligence",
      "location": "ISG Sousse, Tunisia",
      "description": "Graduated with honors, focusing on data-driven solutions. Relevant coursework: Data Analytics, Database Systems. Developed strong foundation in data analysis, system design, and decision support systems.",
      "date": "2020 - 2024"
    }
  },
  "contact": {
    "title": "Contact Me",
    "description": "Please contact me directly at",
    "orForm": "or through this form",
    "nameLabel": "Your name",
    "emailLabel": "Your email",
    "messageLabel": "Your message",
    "submitButton": "Submit",
    "successMessage": "Thank you for your message! I'll get back to you soon.",
    "errorMessage": "Something went wrong. Please try again."
  },
  "footer": {
    "copyright": " 2025 Yassine. All rights reserved.",
    "aboutWebsite": "About this website:",
    "builtWith": "built with React & Next.js, TypeScript, Tailwind CSS, three.js, Framer Motion, React Email & Resend, Vercel hosting."
  }
}